[
    {
        "name": "Lehi Ita Daniel",
        "role": "Chief Executive Officer (CEO)",
        "description": "Lehi is the visionary leader of Global Finance, with a distinguished career spanning over two decades in the financial sector. Her strategic acumen and commitment to innovation drive the company's success and global expansion.",
        "image": "https://via.placeholder.com/150/0000FF/FFFFFF?text=Alice"
    },
    {
        "name": "Seth Ita Daniel",
        "role": "Chief Operations Officer (COO)",
        "description": "Seth is responsible for the operational efficiency and effective execution of Global Finance's services. His expertise ensures seamless delivery and top-tier client satisfaction across all departments.",
        "image": "https://via.placeholder.com/150/FF0000/FFFFFF?text=Bob"
    },
    {
        "name": "Moses La'ah",
        "role": "Senior Portfolio Manager",
        "description": "Moses is an expert in diversified investment portfolios, helping clients achieve long-term financial stability and growth with her analytical approach and deep market insights.",
        "image": "https://via.placeholder.com/150/00FF00/FFFFFF?text=Carol"
    },
    {
        "name": "George Wellington Daniel",
        "role": "Head of Risk Management",
        "description": "David is crucial in identifying and mitigating financial risks, ensuring the security, stability, and regulatory compliance of our operations in an ever-evolving market landscape.",
        "image": "https://via.placeholder.com/150/FFFF00/000000?text=David"
    },
    {
        "name": "Esther Iyabode Akintoke",
        "role": "Lead Financial Analyst",
        "description": "Esther provides in-depth financial analysis and market research, offering critical insights that inform our investment strategies and client advisory services.",
        "image": "https://via.placeholder.com/150/800080/FFFFFF?text=Sarah"
    },
    {
        "name": "Lawrence Effiong",
        "role": "Technology Director",
        "description": "Lawrence leads our technological advancements, ensuring our platforms are cutting-edge, secure, and user-friendly, underpinning our digital financial solutions.",
        "image": "https://via.placeholder.com/150/FFA500/FFFFFF?text=Michael"
    }
]